# AirQuality CaseStudy

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.read_csv("airquality.csv",encoding = "latin")

In [5]:
df1.shape

(153, 7)

In [8]:
(df1.dropna(axis=0)).shape

(111, 7)

# Using the Air Quality data set, Solve the below using the Python.

In [ ]:
# isnull is a function which tell us whether a column has null or not
- symbol is used for NOT

In [9]:
df1[(~df1.Wind.isnull())].Wind.mean()

9.95751633986928

In [10]:
df1.Wind.mean()

9.95751633986928

In [12]:
df1[df1.Wind == np.min(df1.Wind)].Ozone

52   NaN
Name: Ozone, dtype: float64

1. Fetch the observations for 9 day of June
----

In [15]:
df1[(df1.Month == 6) & (df1.Day == 9)]

    Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
39          40   71.0    291.0  13.8    90      6    9

2. Find Average temperature for the month of June.
-------

In [19]:
df1[(df1.Month == 6)].Temp.mean()

79.1

3. To which day of June has the least temperature
------------------

In [57]:
df1[['Temp','Day']][(df1.Month == 6) & (df1.Temp == np.min(df1.Temp[df1.Month == 6]))]

    Temp  Day
48    65   18

4. Find Maximum Ozone value for the month of May
-----

In [59]:
df1[['Ozone']][(df1.Month == 5) & (df1.Ozone == np.max(df1.Ozone[df1.Month == 5]))]

    Ozone
29  115.0

5. Find the count of the missing values in the ozone column of the data set
-----

In [76]:
df1.Ozone.isnull().sum()

37

6. Find out What is the mean of the Ozone column in this dataset
-----------------

In [78]:
df1[~df1.Ozone.isnull()].Ozone.mean()

42.12931034482759

7. Find out which month has the highest temperature
---------

In [81]:
df1[['Month','Temp']][df1.Temp == np.max(df1.Temp)]

     Month  Temp
119      8    97

8. Find out the wind value when the Ozone becomes maximum
-----------

In [82]:
df1[['Wind','Ozone']][df1.Ozone == np.max(df1.Ozone)]

     Wind  Ozone
116   3.4  168.0

9. Find out the months for which the airquality observations have been carried out
---------------

In [88]:
df1.Month.unique()

array([5, 6, 7, 8, 9], dtype=int64)

10. Find the Ozone and temperature values for the 1st observation of every month.
---------------------------

In [103]:
df1[['Ozone','Temp','Day','Month']].sort_values(by = ['Day','Month']).groupby('Month').head(1)

     Ozone  Temp  Day  Month
0     41.0    67    1      5
31     NaN    78    1      6
61   135.0    84    1      7
92    39.0    81    1      8
123   96.0    91    1      9

11. Which day of which month corresponds to the least Ozone Value.
---------

In [105]:
df1[['Month','Day','Ozone']][df1.Ozone == np.min(df1.Ozone)]

    Month  Day  Ozone
20      5   21    1.0

12. Convert the temperature for all the observations to Centigrade scale
-------------

In [115]:
(df1[['Temp']] - 32)/1.8

          Temp
0    19.444444
1    22.222222
2    23.333333
3    16.666667
4    13.333333
5    18.888889
6    18.333333
7    15.000000
8    16.111111
9    20.555556
10   23.333333
11   20.555556
12   18.888889
13   20.000000
14   14.444444
15   17.777778
16   18.888889
17   13.888889
18   20.000000
19   16.666667
20   15.000000
21   22.777778
22   16.111111
23   16.111111
24   13.888889
25   14.444444
26   13.888889
27   19.444444
28   27.222222
29   26.111111
..         ...
123  32.777778
124  33.333333
125  33.888889
126  33.888889
127  30.555556
128  28.888889
129  26.666667
130  25.555556
131  23.888889
132  22.777778
133  27.222222
134  24.444444
135  25.000000
136  21.666667
137  21.666667
138  25.555556
139  19.444444
140  24.444444
141  20.000000
142  27.777778
143  17.777778
144  21.666667
145  27.222222
146  20.555556
147  17.222222
148  21.111111
149  25.000000
150  23.888889
151  24.444444
152  20.000000

[153 rows x 1 columns]